
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВнутридневныеСделки 
	Движения.ВнутридневныеСделки.Записывать = Истина;
	Для Каждого ТекСтрокаДневныеДанные Из ДневныеДанные Цикл
		Движение = Движения.ВнутридневныеСделки.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.БрокерскийСчет = БрокерскийСчет;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаДневныеДанные);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли