
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец = "ТокенOpenAPIТинькофф";
	НастройкиТокена = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, "Токен");
	Если НастройкиТокена <> Неопределено Тогда
		ТокенOpenApiТинькофф = ?(ЗначениеЗаполнено(НастройкиТокена), ЭтотОбъект.УникальныйИдентификатор, "");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Владелец = "ТокенOpenAPIТинькофф";
	Если ТокенOpenApiТинькофф <> Строка(ЭтотОбъект.УникальныйИдентификатор) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, ТокенOpenApiТинькофф, "Токен");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
